/*
* Михаил Лобов
* пробую создавать джинерики
 */

package com.company;

public class Main {

	public static void main(String[] args) {
		box<Integer> iOb;

		iOb = new box<Integer>(88);
		System.out.println("Значение " + iOb.getAdd());

		iOb.getTake();
		iOb = new box<Integer>(0);
		System.out.println("Ой... объкт был удален и теперь он равен " + iOb.getDel());


	// Хех я не понял норм ли я выполнил, поэтому я покажу кое что
	// Только тсс с начала запусти там сюрприз













		
		box<String> strOb = new box <String> ("░░░░░░░░░░▄\n" +
				"░░░░░░░░▄▐░▄▄█████▄▄\n" +
				"░░░░░░▄█████████████▄▀▄▄░▄▄▄\n" +
				"░░░░░█████████████████▄██████\n" +
				"░░░░████▐█████▌████████▌█████▌\n" +
				"░░░████▌█████▌█░████████▐▀██▀\n" +
				"░▄█████░█████▌░█░▀██████▌█▄▄▀▄\n" +
				"░▌███▌█░▐███▌▌░░▄▄░▌█▌███▐███░▀\n" +
				"▐░▐██░░▄▄▐▀█░░░▐▄█▀▌█▐███▐█\n" +
				"░░███░▌▄█▌░░▀░░▀██░░▀██████▌\n" +
				"░░░▀█▌▀██▀░▄░░░░░░░░░███▐███\n" +
				"░░░░██▌░░░░░░░░░░░░░▐███████▌\n" +
				"░░░░███░░░░░▀█▀░░░░░▐██▐███▀▌\n" +
				"░░░░▌█▌█▄░░░░░░░░░▄▄████▀░▀\n" +
				"░░░░░░█▀██▄▄▄░▄▄▀▀▒█▀█░▀\n" +
				"░░░░░░░░░▀░▀█▀▌▒▒▒░▐▄▄\n" +
				"░░░░░░░░▄▄▀▀▄░░░░░░▄▀░▀▀▄▄\n" +
				"░░░░░░▄▀░▄▀▄░▌░░░▄▀░░░░░░▄▀▀▄\n" +
				"░░░░░▐▒▄▀▄▀░▌▀▄▄▀░░░░░░▄▀▒▒▒▐\n" +
				"░░░░▐▒▒▌▀▄░░░░░▌░░░░▄▄▀▒▐▒▒▒▒▌\n" +
				"░░░▐▒▒▐░▌░▀▄░░▄▀▀▄▀▀▒▌▒▐▒▒▒▒▐▐\n" +
				"░░░▌▄▀░░░▄▀░█▀▒▒▒▒▀▄▒▌▐▒▒▒▒▒▌▌\n" +
				"░░▄▀▒▐░▄▀░░░▌▒▐▒▐▒▒▒▌▀▒▒▒▒▒▐▒▌\n"
		+ "  Я ТУПЕНЬКИЙ ПОМОГИТЕ МНЕ ");
		System.out.println(strOb.getAdd());


 }
}
